---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
source: html/c41a9a85-c9d3-0e77-4071-8ba6f3bf7836.htm
---
# ModificationOutsideTransactionException Properties

The information of the function throwing the exception.